/** @file
  Strings for SataDriveInfoSetupUtilityDxe.

;******************************************************************************
;* Copyright (c) 2023 - 2024, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

#langdef en-US "English"

#string STR_EMPTY                                   #language en-US       ""
#string STR_NOT_AVAILABLE                           #language en-US       "Not Available"
#string STR_SUPPORTED                               #language en-US       "Supported"
#string STR_NOT_SUPPORTED                           #language en-US       "Not Supported"
#string STR_ENABLED                                 #language en-US       "Enabled"
#string STR_DISABLED                                #language en-US       "Disabled"
#string STR_SMART_NO_ERROR                          #language en-US       "No Error"
#string STR_SMART_DEVICE_ERROR                      #language en-US       "Device Error"

//
// Root Form
//
#string STR_ROOT_FORM_TITLE                         #language en-US       "SATA Drive Information"

#string STR_DISPLAY_MODE_PROMPT                     #language en-US       "Display Mode"
#string STR_DISPLAY_MODE_HELP                       #language en-US       "Select display mode of drive list"
#string STR_DISPLAY_MODE_OPTION_BY_CONTROLLERS      #language en-US       "By Controllers"
#string STR_DISPLAY_MODE_OPTION_BY_PHYSICAL_PORTS   #language en-US       "By Physical Ports"

#string STR_STATISTICS_FORMAT_BY_CONTROLLERS        #language en-US       "%d Controller(s), %d Drive(s)"
#string STR_STATISTICS_FORMAT_BY_PHYSICAL_PORTS     #language en-US       "%d Physical Port(s)"
#string STR_STATISTICS                              #language en-US       ""

#string STR_HIDE_EMPTY_PORTS_PROMPT                 #language en-US       "Hide Empty Ports"
#string STR_HIDE_EMPTY_PORTS_HELP                   #language en-US       "If checked, the port with no device on it will been hid."

#string STR_CONTROLLER_PROMPT_FORMAT                #language en-US       "Controller #%d - %04x:%04x"

#string STR_CONTROLLER_HELP_FORMAT                  #language en-US       "Device Path: %s\n"

#string STR_DRIVE_HELP_FORMAT                       #language en-US       "Device Path: %s\n"
                                                                          "Capacity: %s\n"
                                                                          "Form Factor: %s\n"
                                                                          "Rotation Rate: %s\n"

#string STR_EMPTY_PORT_FORMAT                       #language en-US       "%s: No Device"

#string STR_NO_DRIVE_DETECTED                       #language en-US       "No Drive Detected"

#string STR_FORM_REFRESH_PROMPT                     #language en-US       "Form Refresh"
#string STR_FORM_REFRESH_HELP                       #language en-US       "Form used in the refresh"

//
// SATA Drive Information Subform
//
#string STR_SUBFORM_TITLE                           #language en-US       "N/A"

#string STR_DEVICE_PATH_TEXT                        #language en-US       "Device Path"
#string STR_DEVICE_PATH_VALUE                       #language en-US       "N/A"
#string STR_DEVICE_PATH_HELP                        #language en-US       "Display device path of this SATA drive."

#string STR_PARENT_DEVICE_PATH_TEXT                 #language en-US       "Parent Device Path"
#string STR_PARENT_DEVICE_PATH_VALUE                #language en-US       "N/A"
#string STR_PARENT_DEVICE_PATH_HELP                 #language en-US       "Display parent device path of this SATA drive."

#string STR_SERIAL_NUMBER_TEXT                      #language en-US       "Serial Number"
#string STR_SERIAL_NUMBER_VALUE                     #language en-US       "N/A"
#string STR_SERIAL_NUMBER_HELP                      #language en-US       "Display the serial number of this SATA drive."

#string STR_CAPACITY_TEXT                           #language en-US       "Capacity"
#string STR_CAPACITY_VALUE                          #language en-US       "N/A"
#string STR_CAPACITY_HELP                           #language en-US       "Display capacity of this SATA drive."

#string STR_FORM_FACTOR_TEXT                        #language en-US       "Form Factor"
#string STR_FORM_FACTOR_VALUE                       #language en-US       "N/A"
#string STR_FORM_FACTOR_HELP                        #language en-US       "Display form factor of this SATA drive."

#string STR_ROTATION_RATE_TEXT                      #language en-US       "Rotation Rate"
#string STR_ROTATION_RATE_VALUE                     #language en-US       "N/A"
#string STR_ROTATION_RATE_HELP                      #language en-US       "Display rotation rate of this SATA drive."

#string STR_SMART_SUPPORTED_TEXT                    #language en-US       "S.M.A.R.T Feature Set Supported"
#string STR_SMART_SUPPORTED_VALUE                   #language en-US       "N/A"
#string STR_SMART_SUPPORTED_HELP                    #language en-US       "Display if S.M.A.R.T Feature Set is supported by this SATA drive."

#string STR_SMART_ENABLED_TEXT                      #language en-US       "S.M.A.R.T Feature Set Enabled"
#string STR_SMART_ENABLED_VALUE                     #language en-US       "N/A"
#string STR_SMART_ENABLED_HELP                      #language en-US       "Display if S.M.A.R.T Feature Set is enabled on this SATA drive."

#string STR_SMART_STATUS_TEXT                       #language en-US       "S.M.A.R.T Return Status"
#string STR_SMART_STATUS_VALUE                      #language en-US       "N/A"
#string STR_SMART_STATUS_HELP                       #language en-US       "Display result of executing S.M.A.R.T Return Status on this SATA drive."

#string STR_SMART_ATTRIBUTE_HELP_FORMAT             #language en-US       "Flag:      %02xh\n"
                                                                          "Value:     %d\n"
                                                                          "Raw Data:  %016lxh\n"
